const CronJob = require("cron").CronJob;
require('dotenv').config()

Array.prototype.random = function () {
    return this[Math.floor((Math.random() * this.length))];
}

const ասացվածքի_սկիզբ = [
    "Ախպերը ախպորը մեռնելը չի ուզի, բայց",
    "Գյուղը կանգնի՝",
    "Եզը որ ընկավ՝",
    "Երբ որ կացինը գա անտառ,",
    "Եօթ անգամ չափիր, մէկ անգամ",
    "Երեխային գործի դիր՝",
    "Երգեր շատ գիտի, բայց",
    "մեծին լսողի ոտքը",
    "Հարսի վոռով",
    "Թրի կտրածը կլավանա,",
    "Ինչ որ ցանես,",
    "Լույսը բացվի,",
    "ով աշխատի՝",
    "Խնձորը ծառից հեռու",
    "Խորամանկ աղվեսը ",
    "Խոզի գլուխը",
    "Կարմիր կովը",
    "Հաց ու պանիր, կեր ու",
    "Հասկացողին մին ասա, չհասկացողին՝",
    "Մի ծաղիկով",
    "Մի գիժ քար գցեց հորը,",
    "Կուժ ասում եմ, կուլա`",
    "Ձենը որ ձվով լինի՝",
    "Մի քոսոտ մոզին"
]

const ասացվածքի_վերջը = [
    ` վատ ապրելը կուզի`,
    ` գերան կը կոտրի։`,
    ` դանակավորը կշատանա`,
    ` ծառերը կասեն... Կոտը մերոնցից է։`,
    ` կտրիր`,
    ` ետևից գնա։`,
    ` գարուն չի գա`,
    ` քարին չի դիպչի`,
    ` փեսուն լավություն կանի`,
    ` լեզվի կտրածը չի լավանա`,
    ` այն կը հնձես`,
    ` բարին հետը`,
    ` նա կուտի`,
    ` չի ընկնում`,
    ` երկու ոտով է թակարդն ընկնում`,
    ` խալու վրա չի մնում`,
    ` կաշին չի փոխի`,
    ` կեր ու բանիր`,
    ` քառասուն իմաստուն չկարողացան հանել`,
    ` լսի`,
    ` հավի ոռը բլբուլի ձեն կհանի`,
    ` սաղ նախիրի անունը կգցի`
]


const job = new CronJob(
    "0 13 * * * *",
    () => {
        let params = {
            status: ասացվածքի_սկիզբ.random() + ասացվածքի_վերջը.random()
        };

        console.log(params)

        var Masto = require('mastodon')
 
        var M = new Masto({
        access_token: process.env.ACCESS_TOKEN,
        timeout_ms: 60*1000, 
        api_url: 'https://xn--69a.xn--99axc.xn--y9a3aq/api/v1/', 
        })

        M.post('statuses', { status: params.status})

    },
    null,
    true
);

job.start();
